DataProcessors/umk_ЗагрузкаДанныхИз1С77_Склад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>umk_ЗагрузкаДанныхИз1С77_Склад</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьКБазе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗатратДляПереработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладМатериалов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обновить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетаПолуфабрикатов</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Отборы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/umk_ПараметрыПодключенияКБазеСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>umk_ПараметрыПодключенияКБазеСклад</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СчетаПолуфабрикатов</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПутьКБазе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗатратДляПереработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладМатериалов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДополнительный</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсходнойПроводки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратТекущегоМесяца</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

AccumulationRegisters/ВыпускПродукцииУслугБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>ВыпускПродукцииУслугБухгалтерскийУчет</Name>
			<Comment>(Регл)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяПозиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеПозиции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетЗатрат</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетСписания</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубконтоСписания1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубконтоСписания2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубконтоСписания3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубконтоСписания4</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПрямыеРасходыРаспределятьПоКоличеству</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговоеНазначениеДоходовИЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

DataProcessors/umk_ЗагрузкаДанныхИз1С77_Склад/Ext/ObjectModule.bsl
Перем Подключено Экспорт;
Перем V7 Экспорт;
Перем МассивДокументов;

Перем мВалютаРегламентированногоУчета;
// Подключает к базе данных 7.7
Процедура ВыполнитьПодключение() Экспорт
	
    ЗапускБезЗаставки = 1;
    V7 = Новый COMОбъект("V1CEnterprise.Application");
    СтрокаПодключения = "/D"""+СокрЛП(ПутьКБазе)+""" /N"""+СокрЛП(Логин)+""" /P"""+СокрЛП(Пароль)+"""";
	
	Попытка
    Подключено = V7.Initialize(V7.RMTrade,СтрокаПодключения,?(ЗапускБезЗаставки = 1,"NO_SPLASH_SHOW",""));
	Исключение
		Предупреждение("Ошибка инициализации. "  + ОписаниеОшибки());
	КонецПопытки;
	
	
	//V7 = Новый COMОбъект("V77.Application");
	//Подключено = Ложь;
	//
	//Попытка 
	//	
	//	Подключено = V7.Initialize(V7.RMTrade,"/D" + СокрЛП(ПутьКБазе) + " /N"+СокрЛП(Логин) + " /P" + СокрЛП(Пароль), "NO_SPLASH_SHOW");  
	//	
	//Исключение
	//	
	//	Предупреждение("Ошибка инициализации. "  + ОписаниеОшибки());
	//	Коннектор = 0;
	//	
	//КонецПопытки;
	//
	
КонецПроцедуры
// Сохраняет настройки формы в РС 
Процедура СохранитьНастройки()Экспорт
	
	// Очистим
	НаборЗаписей = РегистрыСведений.umk_ПараметрыПодключенияКБазеСклад.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
	//Запишем
	ЗаписьРС = РегистрыСведений.umk_ПараметрыПодключенияКБазеСклад.СоздатьМенеджерЗаписи();
	ЗаписьРС.ПутьКБазе = ПутьКБазе;
	ЗаписьРС.Логин  = Логин;
	ЗаписьРС.Пароль = Пароль;
	ЗаписьРС.ВидЗатратДляПереработки = ВидЗатратДляПереработки;
	ЗаписьРС.СкладПродукции = СкладПродукции;
	ЗаписьРС.СкладМатериалов = СкладМатериалов;
	ЗаписьРС.Подразделение = Подразделение;
	ЗаписьРС.ПодразделениеОрганизации = ПодразделениеОрганизации;
	ЗаписьРС.НоменклатурнаяГруппа = НоменклатурнаяГруппа;
	
	ХранилищеСчетов = Новый ХранилищеЗначения(СчетаПолуфабрикатов);
	ЗаписьРС.СчетаПолуфабрикатов =  ХранилищеСчетов;
	ЗаписьРС.Записать(Истина);
	
КонецПроцедуры

#Область Загрузки_данных
// Требовании накладные
Процедура ЗагрузитьТребованияНакладные() Экспорт
	
	ТаблицаПФ = Новый ТаблицаЗначений();
	ТаблицаПФ.Колонки.Добавить("Номенклатура");
	ТаблицаПФ.Колонки.Добавить("Количество");
	
	// Хрпнит значения вупуска продукции 7.7
	Таблица_26 = Новый ТаблицаЗначений();
	Таблица_26.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Таблица_26.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	
	ТМЦ_V7 = V7.CreateObject("Справочник.ТМЦ");
	
	Если  Отборы.Количество() = 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос("В списке исключений ничего не выбрано. Продолжить обмен?", Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат
		КонецЕсли;
	КонецЕсли;
	
	Сообщить("Начало загрузки." + Строка(ТекущаяДата()));
	МассивДокументов = Новый Массив();
	НачатьТранзакцию();
	Запрос = V7.CreateObject("Запрос");
	
	ТекстЗапроса = 
	"//{{ЗАПРОС(Сформировать)
	|Период с '" + Формат(ДатаНачала, "ДФ=dd.MM.yyyy") + "' по '" + Формат(ДатаОкончания,"ДФ=dd.MM.yyyy") + "';
	|Продукция = Регистр.ПроизводственныеЗатраты.Продукция;
	|Материал = Регистр.ПроизводственныеЗатраты.Материал;
	|Количество = Регистр.ПроизводственныеЗатраты.Количество;
	|Функция КоличествоПриход = Приход(Количество);
	|Группировка Продукция упорядочить по Продукция.Наименование без групп;
	|Группировка Материал упорядочить по Материал.Наименование без групп;
	|"//}}ЗАПРОС
	;
	// Если ошибка в запросе, то выход из процедуры
	Если Запрос.Выполнить(ТекстЗапроса) = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗапросВ = V7.CreateObject("Запрос");
	ТекстЗапроса = 
	"//{{ЗАПРОС(ааа)
	|Период с '" + Формат(ДатаНачала, "ДФ=dd.MM.yyyy") + "' по '" + Формат(ДатаОкончания,"ДФ=dd.MM.yyyy") + "';
	|Продукция = Регистр.ВыпускПродукции.Продукция;
	|Количество = Регистр.ВыпускПродукции.Количество;
	|Функция КвоСумма = Сумма(Количество);
	|Группировка Продукция упорядочить по Продукция.Наименование без групп;
	|"//}}ЗАПРОС
	;
	// Если ошибка в запросе, то выход из процедуры
	Если ЗапросВ.Выполнить(ТекстЗапроса) = 0 Тогда
		Возврат;
	КонецЕсли;
	

	Пока Запрос.Группировка(1) = 1 Цикл
		//ЗапросВ.ВНачалоВыборки();
		
		//Если ЗапросВ.Получить(Запрос.Продукция) = 1 Тогда	 // не работает!!!		
			// Документ Требование накладная
			Если Запрос.Продукция.Код = "" Тогда
				Продолжить
			КонецЕсли;
		
			
		    КоличествоПродукции = ПолучитьКоличество(ЗапросВ, Запрос.Продукция);
			
			Если КоличествоПродукции = 0 Тогда
				Продолжить
			КонецЕсли;
			
						
			Требование = Документы.ТребованиеНакладная.СоздатьДокумент();
			Требование.Дата = КонецДня(ДатаОкончания)-1;
			// Заполнить реквизиты значениями по умолчанию.
			ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(Требование, глЗначениеПеременной("глТекущийПользователь"), мВалютаРегламентированногоУчета, "Продажа");
			ОбщегоНазначения.ЗаполнитьОбязательныеРеквизитыШапкиНовогоДокумента(Требование, глЗначениеПеременной("глТекущийПользователь"));
			
			Требование.Подразделение = Подразделение;
			Требование.ПодразделениеОрганизации = ПодразделениеОрганизации;

			Требование.umk_Продукция = НайтиЭлементНоменклатура(Запрос.Продукция);
			Требование.umk_КоличествоПродукции = КоличествоПродукции;//ЗапросВ.КвоСумма;
			
			НоваяСтрока_26 = Таблица_26.Добавить();
			НоваяСтрока_26.Номенклатура = Требование.umk_Продукция;
			НоваяСтрока_26.Количество = КоличествоПродукции;

			
			Требование.СчетЗатрат = ПланыСчетов.Хозрасчетный.ОсновноеПроизводство;
			Требование.СтатьяЗатрат = ВидЗатратДляПереработки;
			Требование.Субконто1 =  ПодразделениеОрганизации;
			
			//Если продукция ПФ, то установим подразделение переработки
			СчетаУчета = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Требование.Организация, Требование.umk_Продукция, Требование.Склад);
            Счет_ = СчетаУчета.СчетУчетаБУ;
			Если ВходитВСписокСчетовПФ(Счет_) Тогда   // Меняем подразделение организации. 
				Требование.Субконто1 =  Константы.umk_ОсновноеПодразделениеПереработка.Получить();
				Требование.ПодразделениеОрганизации = Константы.umk_ОсновноеПодразделениеПереработка.Получить();
			КонецЕсли;
			//
			Требование.Субконто2 =  Требование.umk_Продукция.НоменклатурнаяГруппаЗатрат;
			Требование.Субконто3 =  Требование.СтатьяЗатрат;
			Требование.НоменклатурнаяГруппа = Требование.umk_Продукция.НоменклатурнаяГруппаЗатрат;
			Требование.Склад     =  СкладМатериалов;
			 			
			Пока Запрос.Группировка(2) = 1 Цикл   // ТЧ Материалы 
								
				V7_Номенклатура = Запрос.Материал;
				Если СокрЛП(V7_Номенклатура.ТМЦДляСписания.Наименование) <> "" Тогда
					V7_Номенклатура = Запрос.Материал.ТМЦДляСписания;
				КонецЕсли;
				
				Номенклатура = НайтиЭлементНоменклатура(V7_Номенклатура);
				
				Параметры = Новый Структура("Номенклатура", Номенклатура); 
				Строки = Отборы.НайтиСтроки(Параметры);
				Если Не Строки.Количество() = 0
					Тогда
					Продолжить;
				КонецЕсли;
				
				
				СтрокаТабличнойЧасти = Требование.Материалы.Добавить();
				СтрокаТабличнойЧасти.Номенклатура = Номенклатура;
				СтрокаТабличнойЧасти.Количество   = Запрос.КоличествоПриход;
				// Выполнить общие действия для всех документов при изменении номенклатуры.
				ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, Требование);
				
				СчетаУчета = БухгалтерскийУчет.ПолучитьСчетаУчетаНоменклатуры(Требование.Организация, СтрокаТабличнойЧасти.Номенклатура, Требование.Склад);
                СтрокаТабличнойЧасти.Счет = СчетаУчета.СчетУчетаБУ;
				СтрокаТабличнойЧасти.НалоговоеНазначение = СчетаУчета.НалоговоеНазначение;
				
				СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтрокаТабличнойЧасти.Номенклатура.ЕдиницаХраненияОстатков;
				СтрокаТабличнойЧасти.Коэффициент      = СтрокаТабличнойЧасти.ЕдиницаИзмерения.Коэффициент;
				
				ОбработкаТабличныхЧастей.ЗаполнитьСпособСписанияОстаткаТоваровТабЧасти(СтрокаТабличнойЧасти, Требование);
				
				Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) Тогда
					
					СтрокаТабличнойЧасти.СтатьяЗатрат         = СтрокаТабличнойЧасти.Номенклатура.СтатьяЗатрат;
					СтрокаТабличнойЧасти.НоменклатурнаяГруппа = СтрокаТабличнойЧасти.Номенклатура.НоменклатурнаяГруппаЗатрат;
					
				КонецЕсли;
				
				СтрокаТабличнойЧасти.Качество = Справочники.Качество.Новый;
				
				Если ВходитВСписокСчетовПФ(СтрокаТабличнойЧасти.Счет) Тогда
					
					СтрокаПФ = ТаблицаПФ.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаПФ,СтрокаТабличнойЧасти);
					
				КонецЕсли;
								
			КонецЦикла;
			
			Требование.Записать(РежимЗаписиДокумента.Запись);
			МассивДокументов.Добавить(Требование.Ссылка);

			Состояние(Требование.Ссылка);
		//КонецЕсли;
	
	КонецЦикла;
	
	// Созадим документ Отчет производства за смену началом меяца.
	ТаблицаПФ.Свернуть("Номенклатура","Количество");
	СоздатьДокументОПС(ТаблицаПФ, Таблица_26);
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Ответ = Вопрос("Сохранить документы ""Требование накладная"" в базе?", Режим, 0);
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;   
	
	// Проведем документы
	Режим = РежимДиалогаВопрос.ДаНет;
	Ответ = Вопрос("Выполнить проведение документов?", Режим, 0);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
	   ВыполнитьПроведениеДокументов();	
	КонецЕсли;   
	
 	Сообщить("Обработка импорта требований накладных завершена. " + Строка(ТекущаяДата()));
		
КонецПроцедуры
// Загрузка заказов поставщику
Процедура ЗагрузитьЗаказы() Экспорт
	
	//СпрТМЦВнеш = V7.CreateObject("Справочник.ТМЦ");
	V7_ЗаказСырья = V7.CreateObject("Документ.ЗаказСырья");
	
	НачатьТранзакцию();
	
	V7_ЗаказСырья.УстановитьФильтр(1,0);
	V7_ЗаказСырья.ВыбратьДокументы(ДатаНачала, ДатаОкончания);
	
	Пока V7_ЗаказСырья.ПолучитьДокумент() = 1 Цикл  // По документам V7
		
	 // Найдем Заказ сырья в базе
	   Запрос = Новый Запрос(
	   "ВЫБРАТЬ
	   |	ЗаказСырья.Ссылка
	   |ИЗ
	   |	Документ.ЗаказСырья КАК ЗаказСырья
	   |ГДЕ
	   |	ЗаказСырья.Дата МЕЖДУ &НачалоДня И &КонецДня
	   |	И ЗаказСырья.Номер = &Номер");
	   
	   Запрос.УстановитьПараметр("НачалоДня", НачалоДня(V7_ЗаказСырья.ДатаДок)); 
	   Запрос.УстановитьПараметр("КонецДня",  КонецДня(V7_ЗаказСырья.ДатаДок));
	   Запрос.УстановитьПараметр("Номер",  V7_ЗаказСырья.НомерДок);
	   
	   Результат = Запрос.Выполнить();
	   Выборка = Результат.Выбрать();
	   
	   Если	 Выборка.Следующий()
		   Тогда 
		      Если Не Обновить Тогда
			   Продолжить; // Не обновляем документы, идем дальше
		   КонецЕсли;
		   ЗаказСырья = Выборка.ссыска.ПолучитьОбъект();
	   Иначе
		   ЗаказСырья = Документы.ЗаказСырья.СоздатьДокумент();
	   КонецЕсли;
	   
				
		ЗаказСырья.Дата = V7_ЗаказСырья.ДатаДок;
		ЗаказСырья.Номер = V7_ЗаказСырья.НомерДок; 
		// Заполнить реквизиты значениями по умолчанию.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЗаказСырья, глЗначениеПеременной("глТекущийПользователь"), мВалютаРегламентированногоУчета, "Покупка");
		ОбщегоНазначения.ЗаполнитьОбязательныеРеквизитыШапкиНовогоДокумента(ЗаказСырья, глЗначениеПеременной("глТекущийПользователь"));
			
		ЗаказСырья.Комментарий   = СокрЛП(V7_ЗаказСырья.Примечание);
		ЗаказСырья.КоэффУП       = V7_ЗаказСырья.КоэфУП;
		ЗаказСырья.ДатаНачала    = ДатаНачала;
		ЗаказСырья.ДатаОкончания = ДатаОкончания;
		
		V7_ЗаказСырья.ВыбратьСтроки();  // По строкам ТЧ Товары
		
		Пока V7_ЗаказСырья.ПолучитьСтроку() = 1 Цикл
			НоваяСтрока = ЗаказСырья.Товары.Добавить();
			
			Попытка
				Номенклатура = Справочники.Номенклатура.НайтиПоКоду(Формат(Число(V7_ЗаказСырья.ТМЦ.Код),"ЧЦ=9; ЧВН=; ЧГ="));
			Исключение // если не число
				Номенклатура = Справочники.Номенклатура.НайтиПоКоду("0000" + V7_ЗаказСырья.ТМЦ.Код);
			КонецПопытки;

			Если Номенклатура.Пустая() 
				Тогда
				Сообщить("Не найден элемент с кодом: " + V7_ЗаказСырья.ТМЦ.Код + " " + V7_ЗаказСырья.ТМЦ.Наименование);
			КонецЕсли;
			
			НоваяСтрока.Номенклатура = Номенклатура;
			
			// Заполнение цены зависит от розничности операции.
			Если ЗначениеЗаполнено(НоваяСтрока.Номенклатура) Тогда
				ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПродажиТабЧасти(НоваяСтрока, ЗаказСырья, мВалютаРегламентированногоУчета);
			КонецЕсли;

			НоваяСтрока.Количество  = V7_ЗаказСырья.Кво;
			НоваяСтрока.ОстатокПред = V7_ЗаказСырья.ОстатокПред;
			НоваяСтрока.Заказ       = V7_ЗаказСырья.Заказ;
			НоваяСтрока.ЗаказОконч  = V7_ЗаказСырья.ЗаказОК;
		КонецЦикла;
		
		Режим = РежимЗаписиДокумента.Запись;
				
		Если ЗаказСырья.ПометкаУдаления Тогда
			 ЗаказСырья.ПометкаУдаления = Ложь
		КонецЕсли;
		
		Если ЗаказСырья.Проведен Тогда
			ЗаказСырья.Проведен = Ложь;
			Режим = РежимЗаписиДокумента.ОтменаПроведения;
		КонецЕсли;
		ЗаказСырья.Записать(Режим);
		Сообщить(ЗаказСырья.Ссылка);
		
	КонецЦикла; // По документам V7
	
	#Если Клиент Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос("Сохранить документы в базе?", Режим, 0);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
		КонецЕсли;
	#Иначе
		ЗафиксироватьТранзакцию();
	#КонецЕсли
	
КонецПроцедуры
//Выпуск полуфабрикатов
//при загрузке из Склада 7.7
//
Процедура СоздатьДокументОПС(ТаблицаПФ, Таблица_26)
	
	Выпуск = Документы.ОтчетПроизводстваЗаСмену.СоздатьДокумент();
	Выпуск.Дата = КонецМесяца(ДатаОкончания) - 2;
	Выпуск.Подразделение = Подразделение;
	Выпуск.ПодразделениеОрганизации = Константы.umk_ОсновноеПодразделениеПереработка.Получить();// Установим подразделение для переработки. 
	
	// Заполнить реквизиты значениями по умолчанию.
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(Выпуск, глЗначениеПеременной("глТекущийПользователь"));
	
	Выпуск.СчетЗатрат   = ПланыСчетов.Хозрасчетный.ОсновноеПроизводство;
	
	ОбщегоНазначения.ЗаполнитьОбязательныеРеквизитыШапкиНовогоДокумента(Выпуск, глЗначениеПеременной("глТекущийПользователь"));
	ИспользоватьМатериалы = Ложь;
	Выпуск.Комментарий = "##7.7 Полуфабрикаты. сч.бу 25##";
	Выпуск.Склад = СкладМатериалов;
	
	Для Каждого СтрокаПФ Из ТаблицаПФ Цикл
		// откорректируем количество полуфабриката в соответствии с требованиями накладными
		ОткорректироватьКоличество(СтрокаПФ, Таблица_26);
		
		
		НоваяСтрока = Выпуск.Продукция.Добавить();
		НоваяСтрока.Номенклатура = СтрокаПФ.Номенклатура;
		ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(НоваяСтрока, Выпуск);
		НоваяСтрока.НоменклатурнаяГруппа = НоваяСтрока.Номенклатура.НоменклатурнаяГруппа;
		НоваяСтрока.Количество = СтрокаПФ.Количество;
		НоваяСтрока.Качество = Справочники.Качество.Новый;
		НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ЕдиницаХраненияОстатков;
		НоваяСтрока.Коэффициент      = 1;
		НоваяСтрока.ПлановаяСтоимость = 0.01;
		НоваяСтрока.ПлановаяСтоимостьУпр = 0.01;	
		ОбработкаТабличныхЧастей.ПересчитатьПлановуюСумму(НоваяСтрока, Истина);
		Выпуск.ЗаполнитьСчетаУчетаВСтрокеТабЧасти(НоваяСтрока, "Продукция", Истина, Истина);
	КонецЦикла;

	
	Выпуск.Записать(РежимЗаписиДокумента.Запись);
	Состояние(Выпуск.Ссылка);
	
	МассивДокументов.Добавить(Выпуск.Ссылка);
	
КонецПроцедуры
// Переработка. Списание и оприходование товаров
Процедура ЗагрузитьПереработку() Экспорт
	
	
	Сообщить("Начало загрузки." + Строка(ТекущаяДата()));
	
	МассивДокументов = Новый Массив();
	
	НачатьТранзакцию();
	
	V7_Номенклатура = V7.CreateObject("Справочник.ТМЦ");
	ДокСпВн_V7 = V7.CreateObject("Документ.СписаниеТМЦВпроизводство");
	
	
	ДокСпВн_V7.УстановитьФильтр(1,0);
	ДокСпВн_V7.ВыбратьДокументы(ДатаНачала, ДатаОкончания);
	
	
	// Подготовим таблицу товаров на списание
	
	ТаблицаСписания  = Новый ТаблицаЗначений;
	ТаблицаСписания.Колонки.Добавить("КлючСвязи", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(40)));
	ТаблицаСписания.Колонки.Добавить("Номер_Дата", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(40)));
	ТаблицаСписания.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаСписания.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	
	
	Пока ДокСпВн_V7.ПолучитьДокумент() = 1 Цикл
		
		Если СокрЛП(ДокСпВн_V7.ДокументОснование.НомерДок) <> ""  Тогда
			Продолжить;
		КонецЕсли;
		
		КлючСвязи = ДокСпВн_V7.НомерДок + "_" + Строка(ДокСпВн_V7.ДатаДок);
					
		ДокСпВн_V7.ВыбратьСтроки();
		
		Пока ДокСпВн_V7.ПолучитьСтроку() = 1 Цикл
			
			Номенклатура = НайтиЭлементНоменклатура(ДокСпВн_V7.ТМЦ);
			
			Если Номенклатура.Пустая() Тогда
				Продолжить
			КонецЕсли;
			
			 НоваяСтрока = ТаблицаСписания.Добавить();
			 НоваяСтрока.Номенклатура = Номенклатура;
			 НоваяСтрока.Количество = ДокСпВн_V7.Кво;
			 НоваяСтрока.Номер_Дата = КлючСвязи;
			 НоваяСтрока.КлючСвязи = КлючСвязи;
			 
		КонецЦикла;	
		
	КонецЦикла;	// По списанию 
	
	// Таблица поступления переработки на склад 
	
		ТаблицаОприход  = Новый ТаблицаЗначений;
		ТаблицаОприход.Колонки.Добавить("КлючСвязи", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(40)));
		ТаблицаОприход.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
		ТаблицаОприход.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка"));
		ТаблицаОприход.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТаблицаОприход.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	    ТаблицаОприход.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
		ТаблицаОприход.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
			    
		ДокПрВн_V7 = V7.CreateObject("Документ.ПереработкаМяса");
		ДокПрВн_V7.УстановитьФильтр(1,0);
		ДокПрВн_V7.ВыбратьДокументы(ДатаНачала, ДатаОкончания);
		
		Пока ДокПрВн_V7.ПолучитьДокумент() = 1 Цикл
			
			Если СокрЛП(ДокПрВн_V7.ДокОснование.НомерДок) = ""  Тогда
				Продолжить;
			КонецЕсли;
			
			Дата = ДокПрВн_V7.ДатаДок;
			Номер = ДокПрВн_V7.НомерДок;
			КлючСвязи = ДокПрВн_V7.ДокОснование.НомерДок + "_" + Строка(ДокПрВн_V7.ДокОснование.ДатаДок);
			
			ДокПрВн_V7.ВыбратьСтроки();
			
			Пока ДокПрВн_V7.ПолучитьСтроку() = 1 Цикл
				
				Номенклатура = НайтиЭлементНоменклатура(ДокПрВн_V7.ТМЦ);
				
				Если Номенклатура.Пустая() Тогда
					Продолжить
				КонецЕсли;
				
				НоваяСтрока = ТаблицаОприход.Добавить();
				НоваяСтрока.Дата = Дата;
				НоваяСтрока.Номер = Номер;
				НоваяСтрока.КлючСвязи = КлючСвязи;
				НоваяСтрока.Номенклатура = Номенклатура;				
				НоваяСтрока.Количество = ДокПрВн_V7.ВесФакт;
				НоваяСтрока.Цена = ДокПрВн_V7.ЦенаБезНДС; 
				НоваяСтрока.Сумма = ДокПрВн_V7.СуммаБезНДС;
				
			КонецЦикла;
			
		КонецЦикла;
		
		ОбработатьТаблицы(ТаблицаСписания, ТаблицаОприход);
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос("Сохранить документы ""Выпуск"" в базе?", Режим, 0);
		
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			ОтменитьТранзакцию();
		Иначе
			ЗафиксироватьТранзакцию();
		КонецЕсли;   
		
		// Проведем документы
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос("Выполнить проведение документов?", Режим, 0);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ВыполнитьПроведениеДокументов();	
			ВыполнитьПроверкуСуммДокументов();
		КонецЕсли;   
		
		Сообщить("Обработка импорта Переработки завершена. " + Строка(ТекущаяДата()));
		
			
КонецПроцедуры

Функция НайтиЭлементНоменклатура(V7_Номенклатура)
	
	Попытка
		Номенклатура = Справочники.Номенклатура.НайтиПоКоду(Формат(Число(V7_Номенклатура.Код),"ЧЦ=9; ЧВН=; ЧГ="));
	Исключение // если не число
		Номенклатура = Справочники.Номенклатура.НайтиПоКоду("0000" + V7_Номенклатура.Код);
	КонецПопытки;
	
	Если Номенклатура.Пустая() 
		Тогда
		Сообщить("Не найден элемент с кодом: " + V7_Номенклатура.Код + " " + V7_Номенклатура.Наименование);
	КонецЕсли;
	
	Возврат Номенклатура
	
КонецФункции

Функция ПолучитьКоличество(ЗапросВ, V7_Продукция)
	Количество = 0;
	Пока ЗапросВ.Группировка(1) = 1 Цикл
		
		Если ЗапросВ.Продукция.Код = V7_Продукция.Код
			Тогда
			//Сообщить(ЗапросВ.КвоСумма);
			Количество = ЗапросВ.КвоСумма;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Количество = 0 Тогда
		Сообщить("Не найден выпуск для номенклатуры " + V7_Продукция.Наименование + " " + V7_Продукция.Код);
	КонецЕсли;
	
	Возврат Количество;
	
КонецФункции

Процедура ВыполнитьПроведениеДокументов()
	
	Для Каждого Элемент Из МассивДокументов Цикл
		Документ = Элемент.ПолучитьОбъект();
		Попытка
			Документ.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить(ОписаниеОшибки());
			Документ.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры
// Выпуск. Переработка.
Процедура ВыполнитьПроверкуСуммДокументов()
	
		
	Для Каждого Элемент Из МассивДокументов Цикл
		
		СуммаВыпуск = Элемент.Продукция.Итог("СуммаПлановая");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЕСТЬNULL(СУММА(ХозрасчетныйОборотыДтКт.ВалютнаяСуммаОборотКт), 0) КАК Сумма
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(, , Регистратор, СчетДт В ИЕРАРХИИ (&Счет23), , , , ) КАК ХозрасчетныйОборотыДтКт
			|ГДЕ
			|	ХозрасчетныйОборотыДтКт.Регистратор = &Ссылка";
		
		Запрос.УстановитьПараметр("Счет23", ПланыСчетов.Хозрасчетный.Производство);
		Запрос.УстановитьПараметр("Ссылка", Элемент);

		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Выборка.Следующий();
		
		Если Не Выборка.Сумма = СуммаВыпуск Тогда
			Разница = Выборка.Сумма - СуммаВыпуск;
			Сообщить("Переработка. Не совпадает сумма списания и сумма поступления. Разница: " + Разница + ". Документ " + Строка(Элемент), СтатусСообщения.Важное);
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьТаблицы(ТаблицаСписания, ТаблицаОприход)
	
	Если ТаблицаОприход.Количество() = 0 Тогда
		Сообщить("Нет материалов поступивших из переработки. Документы не загружены", СтатусСообщения.Важное);
		Если ТаблицаСписания.Количество() = 0 Тогда
			Сообщить("Нет материалов списанных в переработку", СтатусСообщения.Важное);
		КонецЕсли;
		Возврат
	КонецЕсли;
	
	Если ТаблицаСписания.Количество() = 0 Тогда
		Сообщить("Нет материалов списанных в переработку. Документы не загружены", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	ТаблицаКлючей = ТаблицаОприход.Скопировать();
	ТаблицаКлючей.Свернуть("КлючСвязи");
		
	Для Каждого Строка Из ТаблицаКлючей Цикл
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Оприход.Номенклатура,
		|	Оприход.Количество,
		|	Оприход.Цена,
		|	Оприход.Сумма,
		|	Оприход.КлючСвязи
		|ПОМЕСТИТЬ ВремТаб
		|ИЗ
		|	&Оприход КАК Оприход
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВремТаб.Номенклатура,
		|	ВремТаб.Количество,
		|	ВремТаб.Цена,
		|	ВремТаб.Сумма,
		|	ВремТаб.КлючСвязи
		|ИЗ
		|	ВремТаб КАК ВремТаб
		|ГДЕ
		|	ВремТаб.КлючСвязи = &КлючСвязи
		|	И ВремТаб.Количество <> 0";
	
	Запрос.УстановитьПараметр("Оприход", ТаблицаОприход);
	Запрос.УстановитьПараметр("КлючСвязи",Строка.КлючСвязи);
	
	Выпуск = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Оприход.Номенклатура,
		|	Оприход.Количество,
		|	Оприход.КлючСвязи
		|ПОМЕСТИТЬ ВремТаб
		|ИЗ
		|	&Списание КАК Оприход
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВремТаб.Номенклатура,
		|	ВремТаб.Количество
		|ИЗ
		|	ВремТаб КАК ВремТаб
		|ГДЕ
		|	ВремТаб.КлючСвязи = &КлючСвязи";
	
	Запрос.УстановитьПараметр("Списание", ТаблицаСписания);
	Запрос.УстановитьПараметр("КлючСвязи",Строка.КлючСвязи);
	
	Списание = Запрос.Выполнить().Выгрузить();

	СоздатьДокументОПС_Переработка(Выпуск, Списание, Строка.КлючСвязи);
		
		
	КонецЦикла
	
КонецПроцедуры

Процедура СоздатьДокументОПС_Переработка(ТЗВыпуск, ТЗСписание, КлючПоиска)
	
	ВыпускСсылка = НайтиДокумент(КлючПоиска);
	
	Если ВыпускСсылка.Пустая() Тогда
		
		Выпуск = Документы.ОтчетПроизводстваЗаСмену.СоздатьДокумент();
		//Выпуск.ОбменДанными.Загрузка = Истина;
		Выпуск.Дата = КонецМесяца(ДатаОкончания) - 2;
		Выпуск.Подразделение = Подразделение;
		Выпуск.ПодразделениеОрганизации = Константы.umk_ОсновноеПодразделениеПереработка.Получить();
		Выпуск.umk_НомерДокумента77 = КлючПоиска;
		// Заполнить реквизиты значениями по умолчанию.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(Выпуск, глЗначениеПеременной("глТекущийПользователь"));
		
		Выпуск.СчетЗатрат   = ПланыСчетов.Хозрасчетный.ОсновноеПроизводство;
	
		ОбщегоНазначения.ЗаполнитьОбязательныеРеквизитыШапкиНовогоДокумента(Выпуск, глЗначениеПеременной("глТекущийПользователь"));
		
		Выпуск.Склад = СкладМатериалов;
		Выпуск.ИспользоватьМатериалы = Истина  ;
		Выпуск.Комментарий = "##7.7 Переработка##";
	Иначе
		Выпуск = ВыпускСсылка.ПолучитьОбъект();
		Выпуск.Продукция.Очистить();
		Выпуск.Материалы.Очистить();
	КонецЕсли;
		
	Для Каждого Строка Из ТЗВыпуск Цикл
		НоваяСтрока = Выпуск.Продукция.Добавить();
		НоваяСтрока.Номенклатура = Строка.Номенклатура;
		НоваяСтрока.Количество = Строка.Количество;
		НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.БазоваяЕдиницаИзмерения;
		НоваяСтрока.Коэффициент      = 1;
		НоваяСтрока.ПлановаяСтоимость = Строка.Цена;
		НоваяСтрока.ПлановаяСтоимостьУпр = Строка.Цена;	
		НоваяСтрока.СуммаПлановая = Строка.Сумма;
		НоваяСтрока.СуммаПлановаяУпр = Строка.Сумма;
		//ОбработкаТабличныхЧастей.ПересчитатьПлановуюСумму(НоваяСтрока, Истина);
		Выпуск.ЗаполнитьСчетаУчетаВСтрокеТабЧасти(НоваяСтрока, "Продукция", Истина, Истина);
		НоваяСтрока.НоменклатурнаяГруппа = НоменклатурнаяГруппа; 
		НоваяСтрока.Качество = Справочники.Качество.Новый;

	КонецЦикла;
	
	Для Каждого Строка Из ТЗСписание Цикл;
		НоваяСтрока = Выпуск.Материалы.Добавить();
		// Выполнить общие действия для всех документов при изменении номенклатуры.
		НоваяСтрока.Номенклатура = Строка.Номенклатура;
        НоваяСтрока.Количество = Строка.Количество;
		ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(НоваяСтрока, Выпуск);
		ОбработкаТабличныхЧастей.ЗаполнитьСпособСписанияОстаткаТоваровТабЧасти(НоваяСтрока, Выпуск);
	
		Выпуск.ЗаполнитьСчетаУчетаВСтрокеТабЧасти(НоваяСтрока, "Материалы", Истина, Истина);
		НоваяСтрока.СтатьяЗатрат = ВидЗатратДляПереработки;
		НоваяСтрока.НоменклатурнаяГруппа = НоменклатурнаяГруппа; 
	    НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ЕдиницаХраненияОстатков;
	    НоваяСтрока.Коэффициент      = НоваяСтрока.ЕдиницаИзмерения.Коэффициент;
	    НоваяСтрока.Качество = Справочники.Качество.Новый;

	КонецЦикла;
	
	
	Если Выпуск.Проведен Тогда
		РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
	Иначе
		РежимЗаписи = РежимЗаписиДокумента.Запись
	КонецЕсли;
	
	Выпуск.Записать(РежимЗаписи);
	Состояние(Выпуск.Ссылка);
	
	МассивДокументов.Добавить(Выпуск.Ссылка);

		
КонецПроцедуры

// Проверяет на вхождение счету БУ в список счетов полуфабрикатов 
Функция ВходитВСписокСчетовПФ(СчетБУ)
	
	Возврат Не СчетаПолуфабрикатов.НайтиПоЗначению(СчетБУ) = Неопределено 
	
КонецФункции


Процедура ОткорректироватьКоличество(СтрокаПФ, Таблица_26)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", СтрокаПФ.Номенклатура);
	
	Запрос.УстановитьПараметр("Таблица_26", Таблица_26);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Таблица_26.Номенклатура,
		|	Таблица_26.Количество
		|ПОМЕСТИТЬ ВремТаб
		|ИЗ
		|	&Таблица_26 КАК Таблица_26
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВремТаб.Номенклатура КАК ПродукцияСклад,
		|	ВремТаб.Количество КАК КоличествоВыпущено
		|ИЗ
		|	ВремТаб КАК ВремТаб
		|ГДЕ
		|	ВремТаб.Номенклатура = &Номенклатура
		|ИТОГИ
		|	СУММА(КоличествоВыпущено)
		|ПО
		|	ПродукцияСклад";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
	
		СтрокаПФ.Количество = Выборка.КоличествоВыпущено;
	
	КонецЕсли;

КонецПроцедуры

Функция НайтиДокумент(КлючПоиска)
	
	Документ = Документы.СписаниеТоваров.ПустаяСсылка();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Документ.Ссылка
		|ИЗ
		|	Документ.ОтчетПроизводстваЗаСмену  КАК Документ
		|ГДЕ
		|	 Документ.umk_НомерДокумента77 = &КлючПоиска";
	
	Запрос.УстановитьПараметр("КлючПоиска", КлючПоиска);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Документ = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Документ
		
КонецФункции

//Отчет о сравнении выпусков 77 и УТП
Процедура СравнитьВыпуск()Экспорт
	
	ТаблицаВыпуска77  = Новый ТаблицаЗначений;
	
	ТаблицаВыпуска77.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаВыпуска77.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));

	
	ЗапросВ = V7.CreateObject("Запрос");
	ТекстЗапроса = 
	"//{{ЗАПРОС(ааа)
	|Период с '" + Формат(ДатаНачала, "ДФ=dd.MM.yyyy") + "' по '" + Формат(ДатаОкончания,"ДФ=dd.MM.yyyy") + "';
	|Продукция = Регистр.ВыпускПродукции.Продукция;
	|Количество = Регистр.ВыпускПродукции.Количество;
	|Функция КвоСумма = Сумма(Количество);
	|Группировка Продукция упорядочить по Продукция.Наименование без групп;
	|"//}}ЗАПРОС
	;
	// Если ошибка в запросе, то выход из процедуры
	Если ЗапросВ.Выполнить(ТекстЗапроса) = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Пока ЗапросВ.Группировка(1) = 1 Цикл
		
		Номенклатура = НайтиЭлементНоменклатура(ЗапросВ.Продукция);
		Если Не ЗначениеЗаполнено(Номенклатура) Тогда
			Продолжить
		КонецЕсли;
		
		НоваяСтрока = ТаблицаВыпуска77.Добавить();
		НоваяСтрока.Номенклатура = Номенклатура;
		НоваяСтрока.Количество = ЗапросВ.КвоСумма;
		
	КонецЦикла;
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("Макет");
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("ТаблицаВыпуска77", ТаблицаВыпуска77);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаВыпуска77.Номенклатура,
		|	ТаблицаВыпуска77.Количество
		|ПОМЕСТИТЬ ВремТаб
		|ИЗ
		|	&ТаблицаВыпуска77 КАК ТаблицаВыпуска77
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыпускПродукцииУслугБухгалтерскийУчетОбороты.Продукция КАК ПродукцияУТП,
		|	ВыпускПродукцииУслугБухгалтерскийУчетОбороты.КоличествоОборот КАК КоличествоУТП,
		|	ВремТаб.Номенклатура КАК ПродукцияСклад,
		|	ВремТаб.Количество КАК КоличествоСклад,
		|	ВремТаб.Количество - ВыпускПродукцииУслугБухгалтерскийУчетОбороты.КоличествоОборот КАК Разница
		|ИЗ
		|	РегистрНакопления.ВыпускПродукцииУслугБухгалтерскийУчет.Обороты(&ДатаНачала, &ДатаОкончания, , ) КАК ВыпускПродукцииУслугБухгалтерскийУчетОбороты
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВремТаб КАК ВремТаб
		|		ПО ВыпускПродукцииУслугБухгалтерскийУчетОбороты.Продукция = ВремТаб.Номенклатура
		|ИТОГИ
		|	СУММА(КоличествоУТП),
		|	СУММА(КоличествоСклад),
		|	СУММА(Разница)
		|ПО
		|	ОБЩИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьОбщийИтог = Макет.ПолучитьОбласть("ОбщиеИтоги");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаОбщийИтог.Следующий();		// Общий итог
	ОбластьОбщийИтог.Параметры.Заполнить(ВыборкаОбщийИтог);
	ТабДок.Вывести(ОбластьОбщийИтог, ВыборкаОбщийИтог.Уровень());
	
	ВыборкаДетальныеЗаписи = ВыборкаОбщийИтог.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДок);
	
КонецПроцедуры

#КонецОбласти

мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
